{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Циклы"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Раз, два, три! Ёлочка, гори!\n",
    "\n",
    "В детском саду проводят новогодний утренник. Со знанием чисел и их порядком у детей пока есть небольшие проблемы, но цифру три знают все без исключения.\n",
    "\n",
    "Напишите программу, которая зажигает Ёлочку, когда все дети прокричат «Три!»\n",
    "\n",
    "**Формат ввода**\n",
    "\n",
    "Вводятся крики детей.\n",
    "\n",
    "**Формат вывода**\n",
    "\n",
    "Выводить «Режим ожидания...», пока дети не прокричат «Три!».\n",
    "В конце вывести «Ёлочка, гори!»"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "while input() != 'Три!':\n",
    "    print(f'Режим ожидания...')\n",
    "print(f'Ёлочка, гори!')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Зайка — 3\n",
    "В задачнике ко второй лекции мы помогали детям искать зайца.\n",
    "На этот раз мы будем искать и считать сразу нескольких зайчат.\n",
    "\n",
    "**Формат ввода**\n",
    "\n",
    "Вводятся строки, описывающие придорожную местность.\n",
    "В конце поездки вводится «Приехали!»\n",
    "\n",
    "**Формат вывода**\n",
    "\n",
    "Количество строк, в которых есть зайка."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "counter = 0\n",
    "while (string := input()) != 'Приехали!':\n",
    "    if 'зайка' in string:\n",
    "        counter += 1\n",
    "print(counter)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Считалочка\n",
    "Ребята в детском саду учат числа, и мы можем им в этом помочь.\n",
    "Ребята дают нам два числа — начало и конец последовательности чисел.\n",
    "Наша задача вывести все числа от начала до конца, заполнив промежуток между ними.\n",
    "\n",
    "**Формат ввода**\n",
    "\n",
    "Два числа в порядке возрастания, каждое с новой строки.\n",
    "\n",
    "**Формат вывода**\n",
    "\n",
    "Все числа от начала до конца (включительно), записанные через пробел."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "a = int(input())\n",
    "b = int(input())\n",
    "\n",
    "for i in range(a, b + 1):\n",
    "    print(f'{i}', end=' ')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Считалочка 2.0\n",
    "Дети продолжают запоминать цифры, а мы им помогать.\n",
    "Нам вновь называют начало и конец последовательности чисел, а мы выводим их и числа между.\n",
    "\n",
    "**Формат ввода**\n",
    "\n",
    "Два числа, каждое с новой строки.\n",
    "\n",
    "**Формат вывода**\n",
    "\n",
    "Все числа от начала до конца (включительно), записанные через пробел."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "a = int(input())\n",
    "b = int(input())\n",
    "\n",
    "if b >= a:\n",
    "    c = 1\n",
    "    b += 1\n",
    "else:\n",
    "    c = -1\n",
    "    b -= 1\n",
    "\n",
    "for i in range(a, b, c):\n",
    "    print(f'{i}', end=' ')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Внимание! Акция!\n",
    "\n",
    "В продуктовом магазине объявили акцию: «На все товары с ценой не менее 500 тугриков предоставляется скидка 10%».\n",
    "\n",
    "Нас попросили разработать программное обеспечение кассового автомата, которое будет считать итоговую сумму покупки с учётом скидки.\n",
    "\n",
    "**Формат ввода**\n",
    "\n",
    "Вводится некоторое количество рациональных чисел — стоимость товаров.\n",
    "\n",
    "Список завершается значением 0.\n",
    "\n",
    "**Формат вывода**\n",
    "\n",
    "Требуется вывести сумму всех товаров с учётом объявленной акции."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "883.0\n"
     ]
    }
   ],
   "source": [
    "sum = 0\n",
    "while (price := float(input())) != 0:\n",
    "    if price >= 500:\n",
    "        price *= 0.9\n",
    "    sum += price\n",
    "\n",
    "print(sum)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## НОД\n",
    "\n",
    "В одном из местных НИИ часто требуется находить наибольший общий делитель (НОД) двух чисел.\n",
    "\n",
    "Вам уже доверяют, как одному из лучших «автоматизаторов» в округе, так что руководство НИИ решило заказать ПО у вас.\n",
    "\n",
    "**Формат ввода**\n",
    "\n",
    "Вводится два натуральных числа, каждое на своей строке.\n",
    "\n",
    "**Формат вывода**\n",
    "\n",
    "Требуется вывести одно натуральное число — НОД двух данных чисел.\n",
    "\n",
    "**Примечание**\n",
    "\n",
    "Самый распространенный способ поиска НОД — алгоритм Евклида."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "a = int(input())\n",
    "b = int(input())\n",
    "\n",
    "while a != 0 and b != 0:\n",
    "    if a > b:\n",
    "        a %= b\n",
    "    else:\n",
    "        b %= a\n",
    "\n",
    "print(a + b)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
